Autodesk.Revit.DB.RenderNode.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RenderNode.NodeName
A readable name of the output node.
Since:
2014

Autodesk.Revit.DB.RenderNode
This is a base class representing a render node in a model-exporting process.
Remarks:
A node can be both geometric (such as an element, light, etc.) or non-geometric (e.g. material).
Some types of nodes are container modes, which include other render nodes.
Since:
2014